export default {
    "autoModel": [
        {
            "modelName": "气体持续扩散模型",
            "modelCode": "hcDiffuseCmbi",
            "legendTree": {
                "checkedKeys": [
                    "爆炸上限",
                    "爆炸下限",
                    "人员死亡",
                    "人员重伤",
                    "人员轻伤"
                ],
                "expandedKeys": [
                    "爆炸",
                    "毒性"
                ],
                "treeData": [
                    {
                        "id": "爆炸",
                        "title": "爆炸",
                        "key": "爆炸",
                        "children": [
                            {
                                "id": "爆炸上限",
                                "title": "爆炸上限",
                                "key": "爆炸上限",
                                "color": "rgba(255, 0, 0, 0.8)"
                            },
                            {
                                "id": "爆炸下限",
                                "title": "爆炸下限",
                                "key": "爆炸下限",
                                "color": "rgba(255, 105, 0, 0.8)"
                            }
                        ]
                    },
                    {
                        "id": "毒性",
                        "title": "毒性",
                        "key": "毒性",
                        "children": [
                            {
                                "id": "人员死亡",
                                "title": "人员死亡",
                                "key": "人员死亡",
                                "color": "rgba(255, 0, 0, 0.8)"
                            },
                            {
                                "id": "人员重伤",
                                "title": "人员重伤",
                                "key": "人员重伤",
                                "color": "rgba(255, 105, 0, 0.8)"
                            },
                            {
                                "id": "人员轻伤",
                                "title": "人员轻伤",
                                "key": "人员轻伤",
                                "color": "rgba(255, 255, 0, 0.8)"
                            }
                        ]
                    }
                ]
            },
            "modelParam": {
                "attr": {
                    "氨": {
                        "外观与性状": [
                            "无色液体（气体），刺激性气味",
                            "/"
                        ],
                        "易燃类型": [
                            "易燃品",
                            "/"
                        ],
                        "物质形态": [
                            "液化气体",
                            "/"
                        ],
                        "PH值": [
                            "——",
                            "/"
                        ],
                        "爆炸上下限": [
                            [
                                15,
                                28
                            ],
                            "%"
                        ],
                        "窒息浓度上下限": [
                            [
                                "/"
                            ],
                            "%"
                        ],
                        "毒性等级": [
                            "Ⅳ",
                            "/"
                        ],
                        "熔点": [
                            "-78 °C",
                            "℃"
                        ],
                        "沸点": [
                            -33.4,
                            "℃"
                        ],
                        "气体轻/重类型": [
                            "轻气",
                            "/"
                        ],
                        "燃烧热": [
                            18602.94,
                            "kJ/kg"
                        ],
                        "汽化热": [
                            1186.2994,
                            "kJ/kg"
                        ],
                        "燃点": [
                            "651℃",
                            "℃"
                        ],
                        "气态密度": [
                            0.76,
                            "kg/m3"
                        ],
                        "分子式": [
                            "NH3",
                            "/"
                        ],
                        "毒性上下限": [
                            [
                                0.001,
                                0.005,
                                0.01
                            ],
                            "kg/m3"
                        ],
                        "相对分子质量": [
                            17,
                            "/"
                        ],
                        "液态密度": [
                            617,
                            "kg/m3"
                        ],
                        "定压比热容": [
                            4.7389,
                            "kJ/(kg*K)"
                        ]
                    }
                },
                "az": "S",
                "cntr_t": 0,
                "dayOrNight": "day",
                "h": 5,
                "lat": 41.625874,
                "ll": [
                    0.9,
                    0.89
                ],
                "lon": 123.452656,
                "material": "氨",
                "occurTime": 1683791177000,
                "p": 10000000,
                "place": "city",
                "t": 200,
                "t_lag": 120,
                "tstep": 20,
                "u": 5,
                "v": 1000,
                "weather": "overcast",
                "z": 5,
                "sys_type": "hcDiffuseCmbi"
            }
        },
        {
            "modelName": "气体瞬时扩散模型",
            "modelCode": "hcDiffuseInstant",
            "legendTree": {
                "checkedKeys": [
                    "爆炸上限",
                    "爆炸下限",
                    "人员死亡",
                    "人员重伤",
                    "人员轻伤"
                ],
                "expandedKeys": [
                    "爆炸",
                    "毒性"
                ],
                "treeData": [
                    {
                        "id": "爆炸",
                        "title": "爆炸",
                        "key": "爆炸",
                        "children": [
                            {
                                "id": "爆炸上限",
                                "title": "爆炸上限",
                                "key": "爆炸上限",
                                "color": "rgba(255, 0, 0, 0.8)"
                            },
                            {
                                "id": "爆炸下限",
                                "title": "爆炸下限",
                                "key": "爆炸下限",
                                "color": "rgba(255, 105, 0, 0.8)"
                            }
                        ]
                    },
                    {
                        "id": "毒性",
                        "title": "毒性",
                        "key": "毒性",
                        "children": [
                            {
                                "id": "人员死亡",
                                "title": "人员死亡",
                                "key": "人员死亡",
                                "color": "rgba(255, 0, 0, 0.8)"
                            },
                            {
                                "id": "人员重伤",
                                "title": "人员重伤",
                                "key": "人员重伤",
                                "color": "rgba(255, 105, 0, 0.8)"
                            },
                            {
                                "id": "人员轻伤",
                                "title": "人员轻伤",
                                "key": "人员轻伤",
                                "color": "rgba(255, 255, 0, 0.8)"
                            }
                        ]
                    }
                ]
            },
            "modelParam": {
                "attr": {
                    "氨": {
                        "外观与性状": [
                            "无色液体（气体），刺激性气味",
                            "/"
                        ],
                        "易燃类型": [
                            "易燃品",
                            "/"
                        ],
                        "物质形态": [
                            "液化气体",
                            "/"
                        ],
                        "PH值": [
                            "——",
                            "/"
                        ],
                        "爆炸上下限": [
                            [
                                15,
                                28
                            ],
                            "%"
                        ],
                        "窒息浓度上下限": [
                            [
                                "/"
                            ],
                            "%"
                        ],
                        "毒性等级": [
                            "Ⅳ",
                            "/"
                        ],
                        "熔点": [
                            "-78 °C",
                            "℃"
                        ],
                        "沸点": [
                            -33.4,
                            "℃"
                        ],
                        "气体轻/重类型": [
                            "轻气",
                            "/"
                        ],
                        "燃烧热": [
                            18602.94,
                            "kJ/kg"
                        ],
                        "汽化热": [
                            1186.2994,
                            "kJ/kg"
                        ],
                        "燃点": [
                            "651℃",
                            "℃"
                        ],
                        "气态密度": [
                            0.76,
                            "kg/m3"
                        ],
                        "分子式": [
                            "NH3",
                            "/"
                        ],
                        "毒性上下限": [
                            [
                                0.001,
                                0.005,
                                0.01
                            ],
                            "kg/m3"
                        ],
                        "相对分子质量": [
                            17,
                            "/"
                        ],
                        "液态密度": [
                            617,
                            "kg/m3"
                        ],
                        "定压比热容": [
                            4.7389,
                            "kJ/(kg*K)"
                        ]
                    }
                },
                "az": "S",
                "cntr_t": 0,
                "dayOrNight": "day",
                "h": 5,
                "lat": 41.625874,
                "ll": [
                    0.9,
                    0.1
                ],
                "lon": 123.452656,
                "material": "氨",
                "occurTime": 1683791177000,
                "p": 10000000,
                "t": 600,
                "t_lag": 120,
                "tstep": 60,
                "u": 5,
                "v": 1000,
                "weather": "overcast",
                "z": 5,
                "sys_type": "hcDiffuseInstant"
            }
        },
        {
            "modelName": "重气持续扩散模型",
            "modelCode": "hcHeavyDiffuseContinue",
            "legendTree": {
                "checkedKeys": [
                    "爆炸上限",
                    "爆炸下限",
                    "人员死亡"
                ],
                "expandedKeys": [
                    "爆炸",
                    "毒性"
                ],
                "treeData": [
                    {
                        "id": "爆炸",
                        "title": "爆炸",
                        "key": "爆炸",
                        "children": [
                            {
                                "id": "爆炸上限",
                                "title": "爆炸上限",
                                "key": "爆炸上限",
                                "color": "rgba(255, 0, 0, 0.8)"
                            },
                            {
                                "id": "爆炸下限",
                                "title": "爆炸下限",
                                "key": "爆炸下限",
                                "color": "rgba(255, 105, 0, 0.8)"
                            }
                        ]
                    },
                    {
                        "id": "毒性",
                        "title": "毒性",
                        "key": "毒性",
                        "children": [
                            {
                                "id": "人员死亡",
                                "title": "人员死亡",
                                "key": "人员死亡",
                                "color": "rgba(255, 0, 0, 0.8)"
                            }
                        ]
                    }
                ]
            },
            "modelParam": {
                "attr": {
                    "氯乙烯": {
                        "外观与性状": [
                            "无色、有醚样气味的气体",
                            "/"
                        ],
                        "易燃类型": [
                            "易燃品",
                            "/"
                        ],
                        "物质形态": [
                            "液化气体",
                            "/"
                        ],
                        "PH值": [
                            "<7",
                            "/"
                        ],
                        "爆炸上下限": [
                            [
                                3.6,
                                31
                            ],
                            "%"
                        ],
                        "窒息浓度上下限": [
                            [
                                "/"
                            ],
                            "%"
                        ],
                        "毒性等级": [
                            "Ⅰ",
                            "/"
                        ],
                        "熔点": [
                            153.7,
                            "℃"
                        ],
                        "沸点": [
                            -13.3,
                            "℃"
                        ],
                        "气体轻/重类型": [
                            "重气",
                            "/"
                        ],
                        "燃烧热": [
                            19135,
                            "kJ/kg"
                        ],
                        "汽化热": [
                            332.85,
                            "kJ/kg"
                        ],
                        "燃点": [
                            151.5,
                            "℃"
                        ],
                        "气态密度": [
                            2.15,
                            "kg/m3"
                        ],
                        "分子式": [
                            "C2H3C",
                            "/"
                        ],
                        "毒性上下限": [
                            [
                                0.001,
                                0.005,
                                0.01
                            ],
                            "kg/m3"
                        ],
                        "相对分子质量": [
                            62.5,
                            "/"
                        ],
                        "液态密度": [
                            910,
                            "kg/m3"
                        ],
                        "定压比热容": [
                            0.8573,
                            "kJ/(kg*K)"
                        ]
                    }
                },
                "az": "S",
                "dr": 60,
                "heat": 0,
                "lat": 41.625874,
                "ll": [
                    0.9,
                    0.895
                ],
                "lon": 123.452656,
                "material": "氯乙烯",
                "occurTime": 1683792219334,
                "p": 10000000,
                "t": 300,
                "t_lag": 20,
                "tstep": 10,
                "u": 5,
                "v": 1000,
                "sys_type": "hcHeavyDiffuseContinue"
            }
        },
        {
            "modelName": "重气瞬时扩散模型",
            "modelCode": "hcHeavyDiffuseInstant",
            "legendTree": {
                "checkedKeys": [
                    "人员死亡"
                ],
                "expandedKeys": [
                    "毒性"
                ],
                "treeData": [
                    {
                        "id": "毒性",
                        "title": "毒性",
                        "key": "毒性",
                        "children": [
                            {
                                "id": "人员死亡",
                                "title": "人员死亡",
                                "key": "人员死亡",
                                "color": "rgba(255, 0, 0, 0.8)"
                            }
                        ]
                    }
                ]
            },
            "modelParam": {
                "attr": {
                    "氯乙烯": {
                        "外观与性状": [
                            "无色、有醚样气味的气体",
                            "/"
                        ],
                        "易燃类型": [
                            "易燃品",
                            "/"
                        ],
                        "物质形态": [
                            "液化气体",
                            "/"
                        ],
                        "PH值": [
                            "<7",
                            "/"
                        ],
                        "爆炸上下限": [
                            [
                                3.6,
                                31
                            ],
                            "%"
                        ],
                        "窒息浓度上下限": [
                            [
                                "/"
                            ],
                            "%"
                        ],
                        "毒性等级": [
                            "Ⅰ",
                            "/"
                        ],
                        "熔点": [
                            153.7,
                            "℃"
                        ],
                        "沸点": [
                            -13.3,
                            "℃"
                        ],
                        "气体轻/重类型": [
                            "重气",
                            "/"
                        ],
                        "燃烧热": [
                            19135,
                            "kJ/kg"
                        ],
                        "汽化热": [
                            332.85,
                            "kJ/kg"
                        ],
                        "燃点": [
                            151.5,
                            "℃"
                        ],
                        "气态密度": [
                            2.15,
                            "kg/m3"
                        ],
                        "分子式": [
                            "C2H3C",
                            "/"
                        ],
                        "毒性上下限": [
                            [
                                0.001,
                                0.005,
                                0.01
                            ],
                            "kg/m3"
                        ],
                        "相对分子质量": [
                            62.5,
                            "/"
                        ],
                        "液态密度": [
                            910,
                            "kg/m3"
                        ],
                        "定压比热容": [
                            0.8573,
                            "kJ/(kg*K)"
                        ]
                    }
                },
                "az": "S",
                "dr": 60,
                "heat": 0,
                "lat": 41.625874,
                "ll": [
                    0.9,
                    0.1
                ],
                "lon": 123.452656,
                "material": "氯乙烯",
                "occurTime": 1683792222168,
                "p": 10000000,
                "t": 500,
                "t_lag": 1,
                "tstep": 10,
                "u": 5,
                "v": 1000,
                "sys_type": "hcHeavyDiffuseInstant"
            }
        },
        {
            "modelName": "气体蒸汽云爆炸模型",
            "modelCode": "hcExplode",
            "legendTree": {
                "checkedKeys": [
                    "人员灾损:三级:死亡",
                    "人员灾损:二级:重伤",
                    "人员灾损:一级:轻伤",
                    "建筑物灾损:五级:倒塌",
                    "建筑物灾损:四级:严重破坏",
                    "建筑物灾损:三级:中度破坏",
                    "建筑物灾损:二级:轻度破坏",
                    "建筑物灾损:一级:玻璃破坏"
                ],
                "expandedKeys": [
                    "人员灾损",
                    "建筑物灾损"
                ],
                "treeData": [
                    {
                        "id": "人员灾损",
                        "title": "人员灾损",
                        "key": "人员灾损",
                        "children": [
                            {
                                "id": "人员灾损:三级:死亡",
                                "title": "人员灾损:三级:死亡",
                                "key": "人员灾损:三级:死亡",
                                "color": "rgba(255, 0, 0, 0.8)"
                            },
                            {
                                "id": "人员灾损:二级:重伤",
                                "title": "人员灾损:二级:重伤",
                                "key": "人员灾损:二级:重伤",
                                "color": "rgba(255, 105, 0, 0.8)"
                            },
                            {
                                "id": "人员灾损:一级:轻伤",
                                "title": "人员灾损:一级:轻伤",
                                "key": "人员灾损:一级:轻伤",
                                "color": "rgba(255, 255, 0, 0.8)"
                            }
                        ]
                    },
                    {
                        "id": "建筑物灾损",
                        "title": "建筑物灾损",
                        "key": "建筑物灾损",
                        "children": [
                            {
                                "id": "建筑物灾损:五级:倒塌",
                                "title": "建筑物灾损:五级:倒塌",
                                "key": "建筑物灾损:五级:倒塌",
                                "color": "rgba(255, 0, 0, 0.8)"
                            },
                            {
                                "id": "建筑物灾损:四级:严重破坏",
                                "title": "建筑物灾损:四级:严重破坏",
                                "key": "建筑物灾损:四级:严重破坏",
                                "color": "rgba(255, 105, 0, 0.8)"
                            },
                            {
                                "id": "建筑物灾损:三级:中度破坏",
                                "title": "建筑物灾损:三级:中度破坏",
                                "key": "建筑物灾损:三级:中度破坏",
                                "color": "rgba(255, 255, 0, 0.8)"
                            },
                            {
                                "id": "建筑物灾损:二级:轻度破坏",
                                "title": "建筑物灾损:二级:轻度破坏",
                                "key": "建筑物灾损:二级:轻度破坏",
                                "color": "rgba(0, 0, 255, 0.8)"
                            },
                            {
                                "id": "建筑物灾损:一级:玻璃破坏",
                                "title": "建筑物灾损:一级:玻璃破坏",
                                "key": "建筑物灾损:一级:玻璃破坏",
                                "color": "rgba(0, 255, 255, 0.8)"
                            }
                        ]
                    }
                ]
            },
            "modelParam": {
                "attr": {
                    "氨": {
                        "外观与性状": [
                            "无色液体（气体），刺激性气味",
                            "/"
                        ],
                        "易燃类型": [
                            "易燃品",
                            "/"
                        ],
                        "物质形态": [
                            "液化气体",
                            "/"
                        ],
                        "PH值": [
                            "——",
                            "/"
                        ],
                        "爆炸上下限": [
                            [
                                15,
                                28
                            ],
                            "%"
                        ],
                        "窒息浓度上下限": [
                            [
                                "/"
                            ],
                            "%"
                        ],
                        "毒性等级": [
                            "Ⅳ",
                            "/"
                        ],
                        "熔点": [
                            "-78 °C",
                            "℃"
                        ],
                        "沸点": [
                            -33.4,
                            "℃"
                        ],
                        "气体轻/重类型": [
                            "轻气",
                            "/"
                        ],
                        "燃烧热": [
                            18602.94,
                            "kJ/kg"
                        ],
                        "汽化热": [
                            1186.2994,
                            "kJ/kg"
                        ],
                        "燃点": [
                            "651℃",
                            "℃"
                        ],
                        "气态密度": [
                            0.76,
                            "kg/m3"
                        ],
                        "分子式": [
                            "NH3",
                            "/"
                        ],
                        "毒性上下限": [
                            [
                                0.001,
                                0.005,
                                0.01
                            ],
                            "kg/m3"
                        ],
                        "相对分子质量": [
                            17,
                            "/"
                        ],
                        "液态密度": [
                            617,
                            "kg/m3"
                        ],
                        "定压比热容": [
                            4.7389,
                            "kJ/(kg*K)"
                        ]
                    }
                },
                "az": "S",
                "beta": 1.8,
                "cntr_t": 0,
                "lat": 41.625874,
                "ll": [
                    0.9,
                    0.5
                ],
                "lon": 123.452656,
                "material": "氨",
                "occurTime": 1683791177000,
                "p": 10000000,
                "p0": 101325,
                "qtnt": 4500,
                "rt": 0.04,
                "t": 1200,
                "t_lag": 1200,
                "tstep": 60,
                "v": 800,
                "sys_type": "hcExplode"
            }
        },
        {
            "modelName": "沸腾液体扩展蒸气爆炸模型",
            "modelCode": "hcBleve",
            "legendTree": {
                "checkedKeys": [
                    "三度烧伤区",
                    "二度烧伤区",
                    "一度烧伤区"
                ],
                "expandedKeys": [
                    "烧伤区"
                ],
                "treeData": [
                    {
                        "id": "烧伤区",
                        "title": "烧伤区",
                        "key": "烧伤区",
                        "children": [
                            {
                                "id": "三度烧伤区",
                                "title": "三度烧伤区",
                                "key": "三度烧伤区",
                                "color": "rgba(255, 0, 0, 0.8)"
                            },
                            {
                                "id": "二度烧伤区",
                                "title": "二度烧伤区",
                                "key": "二度烧伤区",
                                "color": "rgba(255, 105, 0, 0.8)"
                            },
                            {
                                "id": "一度烧伤区",
                                "title": "一度烧伤区",
                                "key": "一度烧伤区",
                                "color": "rgba(255, 255, 0, 0.8)"
                            }
                        ]
                    }
                ]
            },
            "modelParam": {
                "attr": {
                    "异丁烯": {
                        "外观与性状": [
                            "液体、无色、无味",
                            "/"
                        ],
                        "易燃类型": [
                            "易燃品",
                            "/"
                        ],
                        "物质形态": [
                            "液化气体",
                            "/"
                        ],
                        "PH值": [
                            7,
                            "/"
                        ],
                        "爆炸上下限": [
                            [
                                1.8,
                                8.8
                            ],
                            "%"
                        ],
                        "窒息浓度上下限": [
                            [
                                "/"
                            ],
                            "%"
                        ],
                        "毒性等级": [
                            "Ⅳ",
                            "/"
                        ],
                        "熔点": [
                            -140.3,
                            "℃"
                        ],
                        "沸点": [
                            -6.9,
                            "℃"
                        ],
                        "气体轻/重类型": [
                            "重气",
                            "/"
                        ],
                        "燃烧热": [
                            48308.9,
                            "kJ/kg"
                        ],
                        "汽化热": [
                            22.17,
                            "kJ/kg"
                        ],
                        "燃点": [
                            -77,
                            "℃"
                        ],
                        "气态密度": [
                            2.011,
                            "kg/m3"
                        ],
                        "分子式": [
                            "C4H8",
                            "/"
                        ],
                        "毒性上下限": [
                            [
                                0.001,
                                0.005,
                                0.01
                            ],
                            "kg/m3"
                        ],
                        "相对分子质量": [
                            56,
                            "/"
                        ],
                        "液态密度": [
                            670,
                            "kg/m3"
                        ],
                        "定压比热容": [
                            2.176,
                            "kJ/(kg*K)"
                        ]
                    }
                },
                "az": "N",
                "cntr_t": 0,
                "lat": 41.625874,
                "ll": [
                    0.9,
                    0.895
                ],
                "lon": 123.452656,
                "material": "异丁烯",
                "occurTime": 1683791177000,
                "p": 2000000,
                "shapeType": "拱顶罐",
                "storeType": "单储罐",
                "v": 1000,
                "sys_type": "hcBleve"
            }
        },
        {
            "modelName": "液池火模型",
            "modelCode": "hcMultiPool",
            "legendTree": {
                "checkedKeys": [
                    "三度烧伤区",
                    "二度烧伤区",
                    "一度烧伤区"
                ],
                "expandedKeys": [
                    "烧伤区"
                ],
                "treeData": [
                    {
                        "id": "烧伤区",
                        "title": "烧伤区",
                        "key": "烧伤区",
                        "children": [
                            {
                                "id": "三度烧伤区",
                                "title": "三度烧伤区",
                                "key": "三度烧伤区",
                                "color": "rgba(255, 0, 0, 0.8)"
                            },
                            {
                                "id": "二度烧伤区",
                                "title": "二度烧伤区",
                                "key": "二度烧伤区",
                                "color": "rgba(255, 105, 0, 0.8)"
                            },
                            {
                                "id": "一度烧伤区",
                                "title": "一度烧伤区",
                                "key": "一度烧伤区",
                                "color": "rgba(255, 255, 0, 0.8)"
                            }
                        ]
                    }
                ]
            },
            "modelParam": {
                "area": [
                    30
                ],
                "attr": {
                    "异丁烯": {
                        "外观与性状": [
                            "液体、无色、无味",
                            "/"
                        ],
                        "易燃类型": [
                            "易燃品",
                            "/"
                        ],
                        "物质形态": [
                            "液化气体",
                            "/"
                        ],
                        "PH值": [
                            7,
                            "/"
                        ],
                        "爆炸上下限": [
                            [
                                1.8,
                                8.8
                            ],
                            "%"
                        ],
                        "窒息浓度上下限": [
                            [
                                "/"
                            ],
                            "%"
                        ],
                        "毒性等级": [
                            "Ⅳ",
                            "/"
                        ],
                        "熔点": [
                            -140.3,
                            "℃"
                        ],
                        "沸点": [
                            -6.9,
                            "℃"
                        ],
                        "气体轻/重类型": [
                            "重气",
                            "/"
                        ],
                        "燃烧热": [
                            48308.9,
                            "kJ/kg"
                        ],
                        "汽化热": [
                            22.17,
                            "kJ/kg"
                        ],
                        "燃点": [
                            -77,
                            "℃"
                        ],
                        "气态密度": [
                            2.011,
                            "kg/m3"
                        ],
                        "分子式": [
                            "C4H8",
                            "/"
                        ],
                        "毒性上下限": [
                            [
                                0.001,
                                0.005,
                                0.01
                            ],
                            "kg/m3"
                        ],
                        "相对分子质量": [
                            56,
                            "/"
                        ],
                        "液态密度": [
                            670,
                            "kg/m3"
                        ],
                        "定压比热容": [
                            2.176,
                            "kJ/(kg*K)"
                        ]
                    }
                },
                "az": "N",
                "lat": 41.625874,
                "lon": 123.452656,
                "material": "异丁烯",
                "materialName": [
                    "异丁烯"
                ],
                "occurTime": 1683791177000,
                "poolNum": 1,
                "temperature": 25,
                "windSpeed": 5,
                "sys_type": "hcMultiPool"
            }
        },
        {
            "modelName": "喷射火模型",
            "modelCode": "hcSprayFire",
            "legendTree": {
                "checkedKeys": [
                    "三度烧伤区",
                    "二度烧伤区",
                    "一度烧伤区"
                ],
                "expandedKeys": [
                    "烧伤区"
                ],
                "treeData": [
                    {
                        "id": "烧伤区",
                        "title": "烧伤区",
                        "key": "烧伤区",
                        "children": [
                            {
                                "id": "三度烧伤区",
                                "title": "三度烧伤区",
                                "key": "三度烧伤区",
                                "color": "rgba(255, 0, 0, 0.8)"
                            },
                            {
                                "id": "二度烧伤区",
                                "title": "二度烧伤区",
                                "key": "二度烧伤区",
                                "color": "rgba(255, 105, 0, 0.8)"
                            },
                            {
                                "id": "一度烧伤区",
                                "title": "一度烧伤区",
                                "key": "一度烧伤区",
                                "color": "rgba(255, 255, 0, 0.8)"
                            }
                        ]
                    }
                ]
            },
            "modelParam": {
                "attr": {
                    "异丁烯": {
                        "外观与性状": [
                            "液体、无色、无味",
                            "/"
                        ],
                        "易燃类型": [
                            "易燃品",
                            "/"
                        ],
                        "物质形态": [
                            "液化气体",
                            "/"
                        ],
                        "PH值": [
                            7,
                            "/"
                        ],
                        "爆炸上下限": [
                            [
                                1.8,
                                8.8
                            ],
                            "%"
                        ],
                        "窒息浓度上下限": [
                            [
                                "/"
                            ],
                            "%"
                        ],
                        "毒性等级": [
                            "Ⅳ",
                            "/"
                        ],
                        "熔点": [
                            -140.3,
                            "℃"
                        ],
                        "沸点": [
                            -6.9,
                            "℃"
                        ],
                        "气体轻/重类型": [
                            "重气",
                            "/"
                        ],
                        "燃烧热": [
                            48308.9,
                            "kJ/kg"
                        ],
                        "汽化热": [
                            22.17,
                            "kJ/kg"
                        ],
                        "燃点": [
                            -77,
                            "℃"
                        ],
                        "气态密度": [
                            2.011,
                            "kg/m3"
                        ],
                        "分子式": [
                            "C4H8",
                            "/"
                        ],
                        "毒性上下限": [
                            [
                                0.001,
                                0.005,
                                0.01
                            ],
                            "kg/m3"
                        ],
                        "相对分子质量": [
                            56,
                            "/"
                        ],
                        "液态密度": [
                            670,
                            "kg/m3"
                        ],
                        "定压比热容": [
                            2.176,
                            "kJ/(kg*K)"
                        ]
                    }
                },
                "az": "S",
                "cntr_t": 0,
                "h": 10,
                "lat": 41.625874,
                "ll": [
                    0.9,
                    0.895
                ],
                "lon": 123.452656,
                "material": "异丁烯",
                "occurTime": 1683791177000,
                "p": 2000000,
                "pair": 101235,
                "rh": 0.2,
                "shapeType": "拱顶罐",
                "spray_theta": "水平喷射,45",
                "t_lag": 300,
                "tair": 20,
                "v": 1000,
                "sys_type": "hcSprayFire"
            }
        }
    ],
    "evoModel": [
        {
            "modelName": "气体持续扩散模型",
            "modelCode": "hcDiffuseCmbi",
            "legendTree": {
                "checkedKeys": [
                    "爆炸上限",
                    "爆炸下限",
                    "人员死亡",
                    "人员重伤",
                    "人员轻伤"
                ],
                "expandedKeys": [
                    "爆炸",
                    "毒性"
                ],
                "treeData": [
                    {
                        "id": "爆炸",
                        "title": "爆炸",
                        "key": "爆炸",
                        "children": [
                            {
                                "id": "爆炸上限",
                                "title": "爆炸上限",
                                "key": "爆炸上限",
                                "color": "rgba(255, 0, 0, 0.8)"
                            },
                            {
                                "id": "爆炸下限",
                                "title": "爆炸下限",
                                "key": "爆炸下限",
                                "color": "rgba(255, 105, 0, 0.8)"
                            }
                        ]
                    },
                    {
                        "id": "毒性",
                        "title": "毒性",
                        "key": "毒性",
                        "children": [
                            {
                                "id": "人员死亡",
                                "title": "人员死亡",
                                "key": "人员死亡",
                                "color": "rgba(255, 0, 0, 0.8)"
                            },
                            {
                                "id": "人员重伤",
                                "title": "人员重伤",
                                "key": "人员重伤",
                                "color": "rgba(255, 105, 0, 0.8)"
                            },
                            {
                                "id": "人员轻伤",
                                "title": "人员轻伤",
                                "key": "人员轻伤",
                                "color": "rgba(255, 255, 0, 0.8)"
                            }
                        ]
                    }
                ]
            },
            "modelParam": {
                "attr": {
                    "氨": {
                        "外观与性状": [
                            "无色液体（气体），刺激性气味",
                            "/"
                        ],
                        "易燃类型": [
                            "易燃品",
                            "/"
                        ],
                        "物质形态": [
                            "液化气体",
                            "/"
                        ],
                        "PH值": [
                            "——",
                            "/"
                        ],
                        "爆炸上下限": [
                            [
                                15,
                                28
                            ],
                            "%"
                        ],
                        "窒息浓度上下限": [
                            [
                                "/"
                            ],
                            "%"
                        ],
                        "毒性等级": [
                            "Ⅳ",
                            "/"
                        ],
                        "熔点": [
                            "-78 °C",
                            "℃"
                        ],
                        "沸点": [
                            -33.4,
                            "℃"
                        ],
                        "气体轻/重类型": [
                            "轻气",
                            "/"
                        ],
                        "燃烧热": [
                            18602.94,
                            "kJ/kg"
                        ],
                        "汽化热": [
                            1186.2994,
                            "kJ/kg"
                        ],
                        "燃点": [
                            "651℃",
                            "℃"
                        ],
                        "气态密度": [
                            0.76,
                            "kg/m3"
                        ],
                        "分子式": [
                            "NH3",
                            "/"
                        ],
                        "毒性上下限": [
                            [
                                0.001,
                                0.005,
                                0.01
                            ],
                            "kg/m3"
                        ],
                        "相对分子质量": [
                            17,
                            "/"
                        ],
                        "液态密度": [
                            617,
                            "kg/m3"
                        ],
                        "定压比热容": [
                            4.7389,
                            "kJ/(kg*K)"
                        ]
                    }
                },
                "az": "S",
                "cntr_t": 0,
                "dayOrNight": "day",
                "h": 5,
                "lat": 41.625874,
                "ll": [
                    0.9,
                    0.89
                ],
                "lon": 123.452656,
                "material": "氨",
                "occurTime": 1683791177000,
                "p": 10000000,
                "place": "city",
                "t": 200,
                "t_lag": 120,
                "tstep": 20,
                "u": 5,
                "v": 1000,
                "weather": "overcast",
                "z": 5,
                "sys_type": "hcDiffuseCmbi"
            }
        },
        {
            "modelName": "气体瞬时扩散模型",
            "modelCode": "hcDiffuseInstant",
            "legendTree": {
                "checkedKeys": [
                    "爆炸上限",
                    "爆炸下限",
                    "人员死亡",
                    "人员重伤",
                    "人员轻伤"
                ],
                "expandedKeys": [
                    "爆炸",
                    "毒性"
                ],
                "treeData": [
                    {
                        "id": "爆炸",
                        "title": "爆炸",
                        "key": "爆炸",
                        "children": [
                            {
                                "id": "爆炸上限",
                                "title": "爆炸上限",
                                "key": "爆炸上限",
                                "color": "rgba(255, 0, 0, 0.8)"
                            },
                            {
                                "id": "爆炸下限",
                                "title": "爆炸下限",
                                "key": "爆炸下限",
                                "color": "rgba(255, 105, 0, 0.8)"
                            }
                        ]
                    },
                    {
                        "id": "毒性",
                        "title": "毒性",
                        "key": "毒性",
                        "children": [
                            {
                                "id": "人员死亡",
                                "title": "人员死亡",
                                "key": "人员死亡",
                                "color": "rgba(255, 0, 0, 0.8)"
                            },
                            {
                                "id": "人员重伤",
                                "title": "人员重伤",
                                "key": "人员重伤",
                                "color": "rgba(255, 105, 0, 0.8)"
                            },
                            {
                                "id": "人员轻伤",
                                "title": "人员轻伤",
                                "key": "人员轻伤",
                                "color": "rgba(255, 255, 0, 0.8)"
                            }
                        ]
                    }
                ]
            },
            "modelParam": {
                "attr": {
                    "氨": {
                        "外观与性状": [
                            "无色液体（气体），刺激性气味",
                            "/"
                        ],
                        "易燃类型": [
                            "易燃品",
                            "/"
                        ],
                        "物质形态": [
                            "液化气体",
                            "/"
                        ],
                        "PH值": [
                            "——",
                            "/"
                        ],
                        "爆炸上下限": [
                            [
                                15,
                                28
                            ],
                            "%"
                        ],
                        "窒息浓度上下限": [
                            [
                                "/"
                            ],
                            "%"
                        ],
                        "毒性等级": [
                            "Ⅳ",
                            "/"
                        ],
                        "熔点": [
                            "-78 °C",
                            "℃"
                        ],
                        "沸点": [
                            -33.4,
                            "℃"
                        ],
                        "气体轻/重类型": [
                            "轻气",
                            "/"
                        ],
                        "燃烧热": [
                            18602.94,
                            "kJ/kg"
                        ],
                        "汽化热": [
                            1186.2994,
                            "kJ/kg"
                        ],
                        "燃点": [
                            "651℃",
                            "℃"
                        ],
                        "气态密度": [
                            0.76,
                            "kg/m3"
                        ],
                        "分子式": [
                            "NH3",
                            "/"
                        ],
                        "毒性上下限": [
                            [
                                0.001,
                                0.005,
                                0.01
                            ],
                            "kg/m3"
                        ],
                        "相对分子质量": [
                            17,
                            "/"
                        ],
                        "液态密度": [
                            617,
                            "kg/m3"
                        ],
                        "定压比热容": [
                            4.7389,
                            "kJ/(kg*K)"
                        ]
                    }
                },
                "az": "S",
                "cntr_t": 0,
                "dayOrNight": "day",
                "h": 5,
                "lat": 41.625874,
                "ll": [
                    0.9,
                    0.1
                ],
                "lon": 123.452656,
                "material": "氨",
                "occurTime": 1683791177000,
                "p": 10000000,
                "t": 600,
                "t_lag": 120,
                "tstep": 60,
                "u": 5,
                "v": 1000,
                "weather": "overcast",
                "z": 5,
                "sys_type": "hcDiffuseInstant"
            }
        },
        {
            "modelName": "重气持续扩散模型",
            "modelCode": "hcHeavyDiffuseContinue",
            "legendTree": {
                "checkedKeys": [
                    "爆炸上限",
                    "爆炸下限",
                    "人员死亡"
                ],
                "expandedKeys": [
                    "爆炸",
                    "毒性"
                ],
                "treeData": [
                    {
                        "id": "爆炸",
                        "title": "爆炸",
                        "key": "爆炸",
                        "children": [
                            {
                                "id": "爆炸上限",
                                "title": "爆炸上限",
                                "key": "爆炸上限",
                                "color": "rgba(255, 0, 0, 0.8)"
                            },
                            {
                                "id": "爆炸下限",
                                "title": "爆炸下限",
                                "key": "爆炸下限",
                                "color": "rgba(255, 105, 0, 0.8)"
                            }
                        ]
                    },
                    {
                        "id": "毒性",
                        "title": "毒性",
                        "key": "毒性",
                        "children": [
                            {
                                "id": "人员死亡",
                                "title": "人员死亡",
                                "key": "人员死亡",
                                "color": "rgba(255, 0, 0, 0.8)"
                            }
                        ]
                    }
                ]
            },
            "modelParam": {
                "attr": {
                    "氯乙烯": {
                        "外观与性状": [
                            "无色、有醚样气味的气体",
                            "/"
                        ],
                        "易燃类型": [
                            "易燃品",
                            "/"
                        ],
                        "物质形态": [
                            "液化气体",
                            "/"
                        ],
                        "PH值": [
                            "<7",
                            "/"
                        ],
                        "爆炸上下限": [
                            [
                                3.6,
                                31
                            ],
                            "%"
                        ],
                        "窒息浓度上下限": [
                            [
                                "/"
                            ],
                            "%"
                        ],
                        "毒性等级": [
                            "Ⅰ",
                            "/"
                        ],
                        "熔点": [
                            153.7,
                            "℃"
                        ],
                        "沸点": [
                            -13.3,
                            "℃"
                        ],
                        "气体轻/重类型": [
                            "重气",
                            "/"
                        ],
                        "燃烧热": [
                            19135,
                            "kJ/kg"
                        ],
                        "汽化热": [
                            332.85,
                            "kJ/kg"
                        ],
                        "燃点": [
                            151.5,
                            "℃"
                        ],
                        "气态密度": [
                            2.15,
                            "kg/m3"
                        ],
                        "分子式": [
                            "C2H3C",
                            "/"
                        ],
                        "毒性上下限": [
                            [
                                0.001,
                                0.005,
                                0.01
                            ],
                            "kg/m3"
                        ],
                        "相对分子质量": [
                            62.5,
                            "/"
                        ],
                        "液态密度": [
                            910,
                            "kg/m3"
                        ],
                        "定压比热容": [
                            0.8573,
                            "kJ/(kg*K)"
                        ]
                    }
                },
                "az": "S",
                "dr": 60,
                "heat": 0,
                "lat": 41.625874,
                "ll": [
                    0.9,
                    0.895
                ],
                "lon": 123.452656,
                "material": "氯乙烯",
                "occurTime": 1683792219334,
                "p": 10000000,
                "t": 300,
                "t_lag": 20,
                "tstep": 10,
                "u": 5,
                "v": 1000,
                "sys_type": "hcHeavyDiffuseContinue"
            }
        },
        {
            "modelName": "重气瞬时扩散模型",
            "modelCode": "hcHeavyDiffuseInstant",
            "legendTree": {
                "checkedKeys": [
                    "人员死亡"
                ],
                "expandedKeys": [
                    "毒性"
                ],
                "treeData": [
                    {
                        "id": "毒性",
                        "title": "毒性",
                        "key": "毒性",
                        "children": [
                            {
                                "id": "人员死亡",
                                "title": "人员死亡",
                                "key": "人员死亡",
                                "color": "rgba(255, 0, 0, 0.8)"
                            }
                        ]
                    }
                ]
            },
            "modelParam": {
                "attr": {
                    "氯乙烯": {
                        "外观与性状": [
                            "无色、有醚样气味的气体",
                            "/"
                        ],
                        "易燃类型": [
                            "易燃品",
                            "/"
                        ],
                        "物质形态": [
                            "液化气体",
                            "/"
                        ],
                        "PH值": [
                            "<7",
                            "/"
                        ],
                        "爆炸上下限": [
                            [
                                3.6,
                                31
                            ],
                            "%"
                        ],
                        "窒息浓度上下限": [
                            [
                                "/"
                            ],
                            "%"
                        ],
                        "毒性等级": [
                            "Ⅰ",
                            "/"
                        ],
                        "熔点": [
                            153.7,
                            "℃"
                        ],
                        "沸点": [
                            -13.3,
                            "℃"
                        ],
                        "气体轻/重类型": [
                            "重气",
                            "/"
                        ],
                        "燃烧热": [
                            19135,
                            "kJ/kg"
                        ],
                        "汽化热": [
                            332.85,
                            "kJ/kg"
                        ],
                        "燃点": [
                            151.5,
                            "℃"
                        ],
                        "气态密度": [
                            2.15,
                            "kg/m3"
                        ],
                        "分子式": [
                            "C2H3C",
                            "/"
                        ],
                        "毒性上下限": [
                            [
                                0.001,
                                0.005,
                                0.01
                            ],
                            "kg/m3"
                        ],
                        "相对分子质量": [
                            62.5,
                            "/"
                        ],
                        "液态密度": [
                            910,
                            "kg/m3"
                        ],
                        "定压比热容": [
                            0.8573,
                            "kJ/(kg*K)"
                        ]
                    }
                },
                "az": "S",
                "dr": 60,
                "heat": 0,
                "lat": 41.625874,
                "ll": [
                    0.9,
                    0.1
                ],
                "lon": 123.452656,
                "material": "氯乙烯",
                "occurTime": 1683792222168,
                "p": 10000000,
                "t": 500,
                "t_lag": 1,
                "tstep": 10,
                "u": 5,
                "v": 1000,
                "sys_type": "hcHeavyDiffuseInstant"
            }
        },
        {
            "modelName": "气体蒸汽云爆炸模型",
            "modelCode": "hcExplode",
            "legendTree": {
                "checkedKeys": [
                    "人员灾损:三级:死亡",
                    "人员灾损:二级:重伤",
                    "人员灾损:一级:轻伤",
                    "建筑物灾损:五级:倒塌",
                    "建筑物灾损:四级:严重破坏",
                    "建筑物灾损:三级:中度破坏",
                    "建筑物灾损:二级:轻度破坏",
                    "建筑物灾损:一级:玻璃破坏"
                ],
                "expandedKeys": [
                    "人员灾损",
                    "建筑物灾损"
                ],
                "treeData": [
                    {
                        "id": "人员灾损",
                        "title": "人员灾损",
                        "key": "人员灾损",
                        "children": [
                            {
                                "id": "人员灾损:三级:死亡",
                                "title": "人员灾损:三级:死亡",
                                "key": "人员灾损:三级:死亡",
                                "color": "rgba(255, 0, 0, 0.8)"
                            },
                            {
                                "id": "人员灾损:二级:重伤",
                                "title": "人员灾损:二级:重伤",
                                "key": "人员灾损:二级:重伤",
                                "color": "rgba(255, 105, 0, 0.8)"
                            },
                            {
                                "id": "人员灾损:一级:轻伤",
                                "title": "人员灾损:一级:轻伤",
                                "key": "人员灾损:一级:轻伤",
                                "color": "rgba(255, 255, 0, 0.8)"
                            }
                        ]
                    },
                    {
                        "id": "建筑物灾损",
                        "title": "建筑物灾损",
                        "key": "建筑物灾损",
                        "children": [
                            {
                                "id": "建筑物灾损:五级:倒塌",
                                "title": "建筑物灾损:五级:倒塌",
                                "key": "建筑物灾损:五级:倒塌",
                                "color": "rgba(255, 0, 0, 0.8)"
                            },
                            {
                                "id": "建筑物灾损:四级:严重破坏",
                                "title": "建筑物灾损:四级:严重破坏",
                                "key": "建筑物灾损:四级:严重破坏",
                                "color": "rgba(255, 105, 0, 0.8)"
                            },
                            {
                                "id": "建筑物灾损:三级:中度破坏",
                                "title": "建筑物灾损:三级:中度破坏",
                                "key": "建筑物灾损:三级:中度破坏",
                                "color": "rgba(255, 255, 0, 0.8)"
                            },
                            {
                                "id": "建筑物灾损:二级:轻度破坏",
                                "title": "建筑物灾损:二级:轻度破坏",
                                "key": "建筑物灾损:二级:轻度破坏",
                                "color": "rgba(0, 0, 255, 0.8)"
                            },
                            {
                                "id": "建筑物灾损:一级:玻璃破坏",
                                "title": "建筑物灾损:一级:玻璃破坏",
                                "key": "建筑物灾损:一级:玻璃破坏",
                                "color": "rgba(0, 255, 255, 0.8)"
                            }
                        ]
                    }
                ]
            },
            "modelParam": {
                "attr": {
                    "氨": {
                        "外观与性状": [
                            "无色液体（气体），刺激性气味",
                            "/"
                        ],
                        "易燃类型": [
                            "易燃品",
                            "/"
                        ],
                        "物质形态": [
                            "液化气体",
                            "/"
                        ],
                        "PH值": [
                            "——",
                            "/"
                        ],
                        "爆炸上下限": [
                            [
                                15,
                                28
                            ],
                            "%"
                        ],
                        "窒息浓度上下限": [
                            [
                                "/"
                            ],
                            "%"
                        ],
                        "毒性等级": [
                            "Ⅳ",
                            "/"
                        ],
                        "熔点": [
                            "-78 °C",
                            "℃"
                        ],
                        "沸点": [
                            -33.4,
                            "℃"
                        ],
                        "气体轻/重类型": [
                            "轻气",
                            "/"
                        ],
                        "燃烧热": [
                            18602.94,
                            "kJ/kg"
                        ],
                        "汽化热": [
                            1186.2994,
                            "kJ/kg"
                        ],
                        "燃点": [
                            "651℃",
                            "℃"
                        ],
                        "气态密度": [
                            0.76,
                            "kg/m3"
                        ],
                        "分子式": [
                            "NH3",
                            "/"
                        ],
                        "毒性上下限": [
                            [
                                0.001,
                                0.005,
                                0.01
                            ],
                            "kg/m3"
                        ],
                        "相对分子质量": [
                            17,
                            "/"
                        ],
                        "液态密度": [
                            617,
                            "kg/m3"
                        ],
                        "定压比热容": [
                            4.7389,
                            "kJ/(kg*K)"
                        ]
                    }
                },
                "az": "S",
                "beta": 1.8,
                "cntr_t": 0,
                "lat": 41.625874,
                "ll": [
                    0.9,
                    0.5
                ],
                "lon": 123.452656,
                "material": "氨",
                "occurTime": 1683791177000,
                "p": 10000000,
                "p0": 101325,
                "qtnt": 4500,
                "rt": 0.04,
                "t": 1200,
                "t_lag": 1200,
                "tstep": 60,
                "v": 800,
                "sys_type": "hcExplode"
            }
        },
        {
            "modelName": "沸腾液体扩展蒸气爆炸模型",
            "modelCode": "hcBleve",
            "legendTree": {
                "checkedKeys": [
                    "三度烧伤区",
                    "二度烧伤区",
                    "一度烧伤区"
                ],
                "expandedKeys": [
                    "烧伤区"
                ],
                "treeData": [
                    {
                        "id": "烧伤区",
                        "title": "烧伤区",
                        "key": "烧伤区",
                        "children": [
                            {
                                "id": "三度烧伤区",
                                "title": "三度烧伤区",
                                "key": "三度烧伤区",
                                "color": "rgba(255, 0, 0, 0.8)"
                            },
                            {
                                "id": "二度烧伤区",
                                "title": "二度烧伤区",
                                "key": "二度烧伤区",
                                "color": "rgba(255, 105, 0, 0.8)"
                            },
                            {
                                "id": "一度烧伤区",
                                "title": "一度烧伤区",
                                "key": "一度烧伤区",
                                "color": "rgba(255, 255, 0, 0.8)"
                            }
                        ]
                    }
                ]
            },
            "modelParam": {
                "attr": {
                    "异丁烯": {
                        "外观与性状": [
                            "液体、无色、无味",
                            "/"
                        ],
                        "易燃类型": [
                            "易燃品",
                            "/"
                        ],
                        "物质形态": [
                            "液化气体",
                            "/"
                        ],
                        "PH值": [
                            7,
                            "/"
                        ],
                        "爆炸上下限": [
                            [
                                1.8,
                                8.8
                            ],
                            "%"
                        ],
                        "窒息浓度上下限": [
                            [
                                "/"
                            ],
                            "%"
                        ],
                        "毒性等级": [
                            "Ⅳ",
                            "/"
                        ],
                        "熔点": [
                            -140.3,
                            "℃"
                        ],
                        "沸点": [
                            -6.9,
                            "℃"
                        ],
                        "气体轻/重类型": [
                            "重气",
                            "/"
                        ],
                        "燃烧热": [
                            48308.9,
                            "kJ/kg"
                        ],
                        "汽化热": [
                            22.17,
                            "kJ/kg"
                        ],
                        "燃点": [
                            -77,
                            "℃"
                        ],
                        "气态密度": [
                            2.011,
                            "kg/m3"
                        ],
                        "分子式": [
                            "C4H8",
                            "/"
                        ],
                        "毒性上下限": [
                            [
                                0.001,
                                0.005,
                                0.01
                            ],
                            "kg/m3"
                        ],
                        "相对分子质量": [
                            56,
                            "/"
                        ],
                        "液态密度": [
                            670,
                            "kg/m3"
                        ],
                        "定压比热容": [
                            2.176,
                            "kJ/(kg*K)"
                        ]
                    }
                },
                "az": "N",
                "cntr_t": 0,
                "lat": 41.625874,
                "ll": [
                    0.9,
                    0.895
                ],
                "lon": 123.452656,
                "material": "异丁烯",
                "occurTime": 1683791177000,
                "p": 2000000,
                "shapeType": "拱顶罐",
                "storeType": "单储罐",
                "v": 1000,
                "sys_type": "hcBleve"
            }
        },
        {
            "modelName": "液池火模型",
            "modelCode": "hcMultiPool",
            "legendTree": {
                "checkedKeys": [
                    "三度烧伤区",
                    "二度烧伤区",
                    "一度烧伤区"
                ],
                "expandedKeys": [
                    "烧伤区"
                ],
                "treeData": [
                    {
                        "id": "烧伤区",
                        "title": "烧伤区",
                        "key": "烧伤区",
                        "children": [
                            {
                                "id": "三度烧伤区",
                                "title": "三度烧伤区",
                                "key": "三度烧伤区",
                                "color": "rgba(255, 0, 0, 0.8)"
                            },
                            {
                                "id": "二度烧伤区",
                                "title": "二度烧伤区",
                                "key": "二度烧伤区",
                                "color": "rgba(255, 105, 0, 0.8)"
                            },
                            {
                                "id": "一度烧伤区",
                                "title": "一度烧伤区",
                                "key": "一度烧伤区",
                                "color": "rgba(255, 255, 0, 0.8)"
                            }
                        ]
                    }
                ]
            },
            "modelParam": {
                "area": [
                    30
                ],
                "attr": {
                    "异丁烯": {
                        "外观与性状": [
                            "液体、无色、无味",
                            "/"
                        ],
                        "易燃类型": [
                            "易燃品",
                            "/"
                        ],
                        "物质形态": [
                            "液化气体",
                            "/"
                        ],
                        "PH值": [
                            7,
                            "/"
                        ],
                        "爆炸上下限": [
                            [
                                1.8,
                                8.8
                            ],
                            "%"
                        ],
                        "窒息浓度上下限": [
                            [
                                "/"
                            ],
                            "%"
                        ],
                        "毒性等级": [
                            "Ⅳ",
                            "/"
                        ],
                        "熔点": [
                            -140.3,
                            "℃"
                        ],
                        "沸点": [
                            -6.9,
                            "℃"
                        ],
                        "气体轻/重类型": [
                            "重气",
                            "/"
                        ],
                        "燃烧热": [
                            48308.9,
                            "kJ/kg"
                        ],
                        "汽化热": [
                            22.17,
                            "kJ/kg"
                        ],
                        "燃点": [
                            -77,
                            "℃"
                        ],
                        "气态密度": [
                            2.011,
                            "kg/m3"
                        ],
                        "分子式": [
                            "C4H8",
                            "/"
                        ],
                        "毒性上下限": [
                            [
                                0.001,
                                0.005,
                                0.01
                            ],
                            "kg/m3"
                        ],
                        "相对分子质量": [
                            56,
                            "/"
                        ],
                        "液态密度": [
                            670,
                            "kg/m3"
                        ],
                        "定压比热容": [
                            2.176,
                            "kJ/(kg*K)"
                        ]
                    }
                },
                "az": "N",
                "lat": 41.625874,
                "lon": 123.452656,
                "material": "异丁烯",
                "materialName": [
                    "异丁烯"
                ],
                "occurTime": 1683791177000,
                "poolNum": 1,
                "temperature": 25,
                "windSpeed": 5,
                "sys_type": "hcMultiPool"
            }
        },
        {
            "modelName": "喷射火模型",
            "modelCode": "hcSprayFire",
            "legendTree": {
                "checkedKeys": [
                    "三度烧伤区",
                    "二度烧伤区",
                    "一度烧伤区"
                ],
                "expandedKeys": [
                    "烧伤区"
                ],
                "treeData": [
                    {
                        "id": "烧伤区",
                        "title": "烧伤区",
                        "key": "烧伤区",
                        "children": [
                            {
                                "id": "三度烧伤区",
                                "title": "三度烧伤区",
                                "key": "三度烧伤区",
                                "color": "rgba(255, 0, 0, 0.8)"
                            },
                            {
                                "id": "二度烧伤区",
                                "title": "二度烧伤区",
                                "key": "二度烧伤区",
                                "color": "rgba(255, 105, 0, 0.8)"
                            },
                            {
                                "id": "一度烧伤区",
                                "title": "一度烧伤区",
                                "key": "一度烧伤区",
                                "color": "rgba(255, 255, 0, 0.8)"
                            }
                        ]
                    }
                ]
            },
            "modelParam": {
                "attr": {
                    "异丁烯": {
                        "外观与性状": [
                            "液体、无色、无味",
                            "/"
                        ],
                        "易燃类型": [
                            "易燃品",
                            "/"
                        ],
                        "物质形态": [
                            "液化气体",
                            "/"
                        ],
                        "PH值": [
                            7,
                            "/"
                        ],
                        "爆炸上下限": [
                            [
                                1.8,
                                8.8
                            ],
                            "%"
                        ],
                        "窒息浓度上下限": [
                            [
                                "/"
                            ],
                            "%"
                        ],
                        "毒性等级": [
                            "Ⅳ",
                            "/"
                        ],
                        "熔点": [
                            -140.3,
                            "℃"
                        ],
                        "沸点": [
                            -6.9,
                            "℃"
                        ],
                        "气体轻/重类型": [
                            "重气",
                            "/"
                        ],
                        "燃烧热": [
                            48308.9,
                            "kJ/kg"
                        ],
                        "汽化热": [
                            22.17,
                            "kJ/kg"
                        ],
                        "燃点": [
                            -77,
                            "℃"
                        ],
                        "气态密度": [
                            2.011,
                            "kg/m3"
                        ],
                        "分子式": [
                            "C4H8",
                            "/"
                        ],
                        "毒性上下限": [
                            [
                                0.001,
                                0.005,
                                0.01
                            ],
                            "kg/m3"
                        ],
                        "相对分子质量": [
                            56,
                            "/"
                        ],
                        "液态密度": [
                            670,
                            "kg/m3"
                        ],
                        "定压比热容": [
                            2.176,
                            "kJ/(kg*K)"
                        ]
                    }
                },
                "az": "S",
                "cntr_t": 0,
                "h": 10,
                "lat": 41.625874,
                "ll": [
                    0.9,
                    0.895
                ],
                "lon": 123.452656,
                "material": "异丁烯",
                "occurTime": 1683791177000,
                "p": 2000000,
                "pair": 101235,
                "rh": 0.2,
                "shapeType": "拱顶罐",
                "spray_theta": "水平喷射,45",
                "t_lag": 300,
                "tair": 20,
                "v": 1000,
                "sys_type": "hcSprayFire"
            }
        }
    ]
}
